Merge pull request #146 from CRV96/144-implementing-semantic-search-with-spring-ai
144 implementing semantic search with spring ai
